VPro/src/Catalogs/StructuralUnits/StructuralUnits.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>StructuralUnits</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>MainDepartment</name>
      <description>Bộ phận chính</description>
    </items>
    <items>
      <name>MainWarehouse</name>
      <description>Kho chính</description>
    </items>
  </predefined>
  <attributes>
    <name>StructuralUnitType</name>
    <type>
      <types>EnumRef.StructuralUnitsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>OrderWarehouse</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>FRP</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>RetailPriceKind</name>
    <type>
      <types>CatalogRef.PriceKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountInRetail</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>MarkupGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferSource</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferRecipient</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>DisposalsRecipient</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>DisposalsRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesSource</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesRecipient</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationSource</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationRecipient</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationSource</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationRecipient</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Region</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EmailAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/CommonModules/ObjectFillingSBOverridable/Module.bsl
#Region Interface

Procedure OnDefiningRulesStructuralUnitsSettings(Rules) Export
	
	Rules[Type("DocumentObject.WorkOrder")]				= Catalogs.StructuralUnits.MainDepartment;
	Rules[Type("DocumentObject.PurchaseOrder")]			= Catalogs.StructuralUnits.MainDepartment;
	Rules[Type("DocumentObject.Payroll")]						= Catalogs.StructuralUnits.MainDepartment;
	Rules[Type("DocumentObject.SalesTarget")]				= Catalogs.StructuralUnits.MainDepartment;
	Rules[Type("DocumentObject.PayrollSheet")]				= Catalogs.StructuralUnits.MainDepartment;
	Rules[Type("DocumentObject.OtherExpenses")]			= Catalogs.StructuralUnits.MainDepartment;
	Rules[Type("DocumentObject.CostAllocation")]			= Catalogs.StructuralUnits.MainDepartment;
	Rules[Type("DocumentObject.JobSheet")]					= Catalogs.StructuralUnits.MainDepartment;
	Rules[Type("DocumentObject.Timesheet")]				= Catalogs.StructuralUnits.MainDepartment;
	Rules[Type("DocumentObject.TimeTracking")]			= Catalogs.StructuralUnits.MainDepartment;
	Rules[Type("DocumentObject.InventoryAssembly")]	= Catalogs.StructuralUnits.MainDepartment;
	Rules[Type("DocumentObject.ProductionOrder")]		= Catalogs.StructuralUnits.MainDepartment;
	
	Rules[Type("DocumentObject.AdditionalCosts")]				= CommonUseClientServer.PredefinedItem("Catalog.StructuralUnits.MainWarehouse");
	Rules[Type("DocumentObject.InventoryReconciliation")]	= CommonUseClientServer.PredefinedItem("Catalog.StructuralUnits.MainWarehouse");
	Rules[Type("DocumentObject.InventoryReceipt")]			= CommonUseClientServer.PredefinedItem("Catalog.StructuralUnits.MainWarehouse");
	Rules[Type("DocumentObject.ProcessingReport")]			= CommonUseClientServer.PredefinedItem("Catalog.StructuralUnits.MainWarehouse");
	Rules[Type("DocumentObject.SubcontractorReport")]		= CommonUseClientServer.PredefinedItem("Catalog.StructuralUnits.MainWarehouse");
	Rules[Type("DocumentObject.TransferBetweenCells")]		= CommonUseClientServer.PredefinedItem("Catalog.StructuralUnits.MainWarehouse");
	Rules[Type("DocumentObject.FixedAssetsEnter")]			= CommonUseClientServer.PredefinedItem("Catalog.StructuralUnits.MainWarehouse");
	Rules[Type("DocumentObject.SupplierInvoice")]				= CommonUseClientServer.PredefinedItem("Catalog.StructuralUnits.MainWarehouse");
	Rules[Type("DocumentObject.GoodsReceipt")]				= CommonUseClientServer.PredefinedItem("Catalog.StructuralUnits.MainWarehouse");
	Rules[Type("DocumentObject.GoodsExpense")]				= CommonUseClientServer.PredefinedItem("Catalog.StructuralUnits.MainWarehouse");
	Rules[Type("DocumentObject.CustomerInvoice")]			= CommonUseClientServer.PredefinedItem("Catalog.StructuralUnits.MainWarehouse");
	Rules[Type("DocumentObject.InventoryWriteOff")]			= CommonUseClientServer.PredefinedItem("Catalog.StructuralUnits.MainWarehouse");
	Rules[Type("DocumentObject.InventoryTransfer")]			= CommonUseClientServer.PredefinedItem("Catalog.StructuralUnits.MainWarehouse");
	
EndProcedure

#EndRegion
